# st = 'as 23 fdfdg544 '
# num = []
# for sym in st:
#     if sym.isdigit():
#         num.append(int(sym))
#         num.sort()
# print(*num, sep=',')

########################################################

# st = 'as 23 fdfdg544 34' #введена строка   23, 544, 34 #вивело в консолі
# for sym in st.split():
#     print(sym)

##################################################

# greeting = 'Hello, world'
# list1 = []
# for w in greeting:
#     list1.append(w.upper())
# print(list1)

##############################################

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
# list1 = []
# for i in range(0,50):
#     list1.append(i**2)
# print(list1)

#################################################

# function
#
# - створити функцію яка виводить ліст
def func1():
    list1 = [1,2,3,4]
    print(list1)
# - створити функцію яка приймає три числа та виводить та повертає найменьше.
def minum(a,b,c):
    minum = min(a,b,c)
    return minum
print(minum(1, 2, 3))
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
def maxNum(a,b,c):
    maxNum = max(a,b,c)
    return maxNum
print(maxNum(10, 20, 30))
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
def minMAx(*args):
    print(max(args))
    return min(args)
# - створити функцію яка виводить ліст
def list2(*args):
    print(list(args))
# - створити функцію яка повертає найбільше число з ліста
def maxList():
    list = [1,2,3,4,555]
    return max(list)
print(maxList())
# - створити функцію яка повертає найменьше число з ліста
def minList():
    list = [19,29,39,49,555]
    return min(list)
print(minList())
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
def sumNum(*args):
    return sum(args)
print(sumNum(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100))
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
def sumNum(*args):
    return sum(args)//len(args)
print(sumNum(10,20,30))

#####################################################
# 1)Дан лист:
list3 = [22, 3,5,2,8,2,-23, 8,23,5]
#   - найти min число в листе
min(list3)
#   - удалить все дубликаты в листе
list(set(list3))
#   - заменить каждое четвертое значение на "Х"

# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
def kvadrat(a):
    print('*'*a)
    for i in range(1,a):
        print('*'+' '*(a-2)+'*')
    print('*' * a)
kvadrat(10)
# 3) вывести табличку умножения с помощью цикла while
# 4) переделать первое задание под меню с помощью цикла
